import random
answers = ["Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да",
           "Можешь быть уверен в этом", "Мне кажется - да", "Вероятнее всего",
           "Хорошие перспективы", "Да", "Пока неясно", "попробуй снова",
           "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать",
           "Сконцентрируйся и спроси опять", "Даже не думай", "Мой ответ - нет",
           "По моим данным - нет", "Перспективы не очень хорошие", "Весьма сомнительно"]

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
print('Как тебя зовут?')
name = input()
print('Привет', name)

while True:
    print('Задавай свой вопрос:')
    question_one = input()
    answer = random.choice(answers)
    print(answer)
    print('У вас остались еще вопросы? (Да/Нет)')
    questions_two = input()
    if questions_two.lower() == 'нет'.lower():
        print('Возвращайся если возникнут вопросы!')
        break
    elif questions_two.lower() == 'да'.lower():
        continue
    else:
        print('Извини, не понял, но спроси что-нибудь еще!')

